reports/stage1/wrkLogsPut.txt
Running 15s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.139ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  501.07us   2.35ms   61.82%
    Req/Sec     2.10k   168.83     2.56k    65.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.48ms
 90.000%    1.82ms
 99.000%    2.11ms
 99.900%    2.20ms
 99.990%    2.28ms
 99.999%    2.35ms
100.000%    2.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.073     0.000000            1         1.00
       0.405     0.100000         1001         1.11
       0.629     0.200000         1999         1.25
       0.828     0.300000         3002         1.43
       0.979     0.400000         4000         1.67
       1.107     0.500000         4997         2.00
       1.160     0.550000         5497         2.22
       1.219     0.600000         5998         2.50
       1.283     0.650000         6499         2.86
       1.374     0.700000         6998         3.33
       1.476     0.750000         7495         4.00
       1.538     0.775000         7747         4.44
       1.593     0.800000         7996         5.00
       1.650     0.825000         8248         5.71
       1.705     0.850000         8497         6.67
       1.757     0.875000         8749         8.00
       1.784     0.887500         8870         8.89
       1.815     0.900000         8995        10.00
       1.845     0.912500         9119        11.43
       1.878     0.925000         9244        13.33
       1.912     0.937500         9373        16.00
       1.931     0.943750         9432        17.78
       1.950     0.950000         9496        20.00
       1.968     0.956250         9562        22.86
       1.989     0.962500         9619        26.67
       2.009     0.968750         9683        32.00
       2.023     0.971875         9713        35.56
       2.034     0.975000         9745        40.00
       2.051     0.978125         9781        45.71
       2.061     0.981250         9808        53.33
       2.077     0.984375         9839        64.00
       2.083     0.985938         9856        71.11
       2.089     0.987500         9870        80.00
       2.099     0.989062         9884        91.43
       2.115     0.990625         9904       106.67
       2.123     0.992188         9917       128.00
       2.125     0.992969         9923       142.22
       2.131     0.993750         9932       160.00
       2.135     0.994531         9939       182.86
       2.145     0.995313         9947       213.33
       2.155     0.996094         9955       256.00
       2.159     0.996484         9959       284.44
       2.165     0.996875         9963       320.00
       2.167     0.997266         9966       365.71
       2.177     0.997656         9970       426.67
       2.185     0.998047         9975       512.00
       2.187     0.998242         9977       568.89
       2.191     0.998437         9979       640.00
       2.193     0.998633         9980       731.43
       2.201     0.998828         9982       853.33
       2.207     0.999023         9985      1024.00
       2.207     0.999121         9985      1137.78
       2.221     0.999219         9986      1280.00
       2.225     0.999316         9988      1462.86
       2.225     0.999414         9988      1706.67
       2.233     0.999512         9989      2048.00
       2.233     0.999561         9989      2275.56
       2.257     0.999609         9990      2560.00
       2.257     0.999658         9990      2925.71
       2.261     0.999707         9991      3413.33
       2.261     0.999756         9991      4096.00
       2.261     0.999780         9991      4551.11
       2.281     0.999805         9992      5120.00
       2.281     0.999829         9992      5851.43
       2.281     0.999854         9992      6826.67
       2.281     0.999878         9992      8192.00
       2.281     0.999890         9992      9102.22
       2.349     0.999902         9993     10240.00
       2.349     1.000000         9993          inf
#[Mean    =        1.108, StdDeviation   =        0.501]
#[Max     =        2.348, Total count    =         9993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  182.00us
 75.000%  215.00us
 90.000%  239.00us
 99.000%  305.00us
 99.900%  414.00us
 99.990%  612.00us
 99.999%  619.00us
100.000%  619.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.029     0.000000            1         1.00
       0.098     0.100000         1000         1.11
       0.120     0.200000         2027         1.25
       0.141     0.300000         3034         1.43
       0.162     0.400000         4028         1.67
       0.182     0.500000         4997         2.00
       0.193     0.550000         5542         2.22
       0.202     0.600000         6064         2.50
       0.208     0.650000         6567         2.86
       0.212     0.700000         7057         3.33
       0.215     0.750000         7614         4.00
       0.216     0.775000         7768         4.44
       0.219     0.800000         8053         5.00
       0.223     0.825000         8291         5.71
       0.227     0.850000         8503         6.67
       0.234     0.875000         8759         8.00
       0.237     0.887500         8904         8.89
       0.239     0.900000         8997        10.00
       0.243     0.912500         9133        11.43
       0.248     0.925000         9262        13.33
       0.251     0.937500         9373        16.00
       0.254     0.943750         9439        17.78
       0.257     0.950000         9501        20.00
       0.260     0.956250         9557        22.86
       0.264     0.962500         9620        26.67
       0.269     0.968750         9688        32.00
       0.272     0.971875         9725        35.56
       0.274     0.975000         9746        40.00
       0.278     0.978125         9781        45.71
       0.282     0.981250         9812        53.33
       0.288     0.984375         9838        64.00
       0.291     0.985938         9855        71.11
       0.298     0.987500         9873        80.00
       0.301     0.989062         9885        91.43
       0.308     0.990625         9900       106.67
       0.318     0.992188         9918       128.00
       0.320     0.992969         9924       142.22
       0.323     0.993750         9933       160.00
       0.327     0.994531         9941       182.86
       0.331     0.995313         9947       213.33
       0.339     0.996094         9954       256.00
       0.342     0.996484         9958       284.44
       0.349     0.996875         9962       320.00
       0.356     0.997266         9967       365.71
       0.361     0.997656         9971       426.67
       0.373     0.998047         9974       512.00
       0.389     0.998242         9976       568.89
       0.406     0.998437         9978       640.00
       0.409     0.998633         9980       731.43
       0.411     0.998828         9982       853.33
       0.418     0.999023         9984      1024.00
       0.423     0.999121         9985      1137.78
       0.446     0.999219         9986      1280.00
       0.448     0.999316         9987      1462.86
       0.455     0.999414         9988      1706.67
       0.463     0.999512         9989      2048.00
       0.463     0.999561         9989      2275.56
       0.489     0.999609         9990      2560.00
       0.489     0.999658         9990      2925.71
       0.547     0.999707         9991      3413.33
       0.547     0.999756         9991      4096.00
       0.547     0.999780         9991      4551.11
       0.612     0.999805         9992      5120.00
       0.612     0.999829         9992      5851.43
       0.612     0.999854         9992      6826.67
       0.612     0.999878         9992      8192.00
       0.612     0.999890         9992      9102.22
       0.619     0.999902         9993     10240.00
       0.619     1.000000         9993          inf
#[Mean    =        0.176, StdDeviation   =        0.056]
#[Max     =        0.619, Total count    =         9993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30000 requests in 15.00s, 1.92MB read
Requests/sec:   1999.88
Transfer/sec:    130.85KB